Revit 2026 API

# SphericalLightDistribution(SphericalLightDistribution) Constructor

---

Creates a copy of the given spherical light distribution

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SphericalLightDistribution(
	SphericalLightDistribution other
)
```
```vb
Public Sub New (
	other As SphericalLightDistribution
)
```
```cpp
public:
SphericalLightDistribution(
	SphericalLightDistribution^ other
)
```
```fsharp
new :
        other : SphericalLightDistribution -> SphericalLightDistribution
```

#### Parameters

other SphericalLightDistribution

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

SphericalLightDistribution Class

SphericalLightDistribution Overload

Autodesk.Revit.DB.Lighting Namespace